rolando042001/Agritech/5_2_ESP32Cam_WIFI_Web/app_httpd.cpp
    int val = atoi(value);
    sensor_t * s = esp_camera_sensor_get();
    int res = 0;
    //Serial.println(variable);
    if(!strcmp(variable, "framesize")) 
    {
        Serial.println("framesize");
        if(s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
    }
    else if(!strcmp(variable, "quality")) 
    {
      Serial.println("quality");
      res = s->set_quality(s, val);
    }
    //Remote Control Car 
    //Don't use channel 1 and channel 2
    else if(!strcmp(variable, "flash")) 
    {
      ledcWrite(7,val);
    }  
    else if(!strcmp(variable, "speed")) 
    {
      if      (val > 255) val = 255;
      else if (val <   0) val = 0;       
      txdata[1] = Speed;
      txdata[2] = val;
      Serial.write(txdata, 4);
    }           
    // else if(!strcmp(variable, "servo"))
    // {
    //   if      (val > 180) val = 180;
    //   else if (val < 0) val = 0;     
    //   //ledcWrite(8,10*val);
    //   txdata[1] = Servo;
    //   txdata[2] = val;
    //   Serial.write(txdata, 4);
    // }

     // ===== SERVO PAN =====
    else if(!strcmp(variable, "pan"))
    {
        if(val < 0) val = 0;
       else if(val > 180) val = 180;

        txdata[1] = Servo_pan;
        txdata[2] = val;
        Serial.write(txdata,4);
    }

     // ===== SERVO DOLLY =====
    else if(!strcmp(variable, "dolly"))
    {
        if(val < 0) val = 0;
       else if(val > 180) val = 180;

        txdata[1] = Servo_dolly;
        txdata[2] = val;
        Serial.write(txdata,4);
    }

    // ===== SERVO TILT =====
    else if(!strcmp(variable, "tilt"))
    {
        if(val < 0) val = 0;
        else if(val > 180) val = 180;

        txdata[1] = Servo_tilt;
        txdata[2] = val;
        Serial.write(txdata,4);
    }

// ===== BLOWER FAN =====
else if(!strcmp(variable, "blower"))
{
    txdata[1] = blower_fan; 

    if(val == 16){         // ON
        txdata[2] = 1;
        Serial.write(txdata, 4);
        Serial.println("Blower ON");
    }
    else if(val == 0){     // OFF
        txdata[2] = 0;
        Serial.write(txdata, 4);
        Serial.println("Blower OFF");
    }
}

    else if(!strcmp(variable, "actuator"))
{
    if(val == 1){ // UP
        txdata[1] = Actuator_up;
        txdata[2] = 1;
        Serial.write(txdata, 4);
    }
    else if(val == 2){ // DOWN
        txdata[1] = Actuator_down;
        txdata[2] = 1;
        Serial.write(txdata, 4);
    }
    else if(val == 0){ // STOP
        txdata[1] = Actuator_up;
        txdata[2] = Actuator_Stop_Value;
        Serial.write(txdata, 4);
    }
}




    else if(!strcmp(variable, "model")) 
    {
      txdata[2] = 0;
      if (val==2)
      {
        txdata[1] = Model2;
        Serial.write(txdata, 4);
      }
      if (val==3)
      {
        txdata[1] = Model3;
        Serial.write(txdata, 4);
      }
      if (val==4)
      {
        txdata[1] = Model4;
        Serial.write(txdata, 4);
      }
    }
    else if(!strcmp(variable, "car")) 
    {  
      txdata[1] = Model1;
      if (val==1) 
      {
        txdata[2] = Forward;
        Serial.write(txdata, 4);
        //Serial.println("Go");
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);
      }
      else if (val==2) 
      {   
        txdata[2] = Turn_Right;
        Serial.write(txdata, 4);
        //Serial.println("Right");
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);
      }
      else if (val==3) 
      {
        txdata[2] = Stop;
        Serial.write(txdata, 4);
        //Serial.println("Stop");
        actstate = stp;       
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2); 
      }
      else if (val==4) 
      {
        txdata[2] = Turn_Left;
        Serial.write(txdata, 4);
        //Serial.println("Left");
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);        
      }
      else if (val==5) 
      {
        txdata[2] = Backward;
        Serial.write(txdata, 4);
        //Serial.println("Back");  
        actstate = rev;      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==6) 
      {
        txdata[2] = Top_Left;
        Serial.write(txdata, 4);
        //Serial.println("Back");       
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==7) 
      {
        txdata[2] = Top_Right;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==8) 
      {
        txdata[2] = Bottom_Left;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==9) 
      {
        txdata[2] = Bottom_Right;
        Serial.write(txdata, 4);
        //Serial.println("Back");       
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==10) 
      {
        txdata[2] = Clockwise;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==11) 
      {
        txdata[2] = Model1;
        Serial.write(txdata, 4);
        //Serial.println("Back");       
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==12) 
      {
        txdata[2] = Model2;
        Serial.write(txdata, 4);
        //Serial.println("Back");     
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==13) 
      {
        txdata[2] = Model3;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==14) 
      {
        txdata[2] = Model4;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
      else if (val==15) 
      {
        txdata[2] = Contrarotate;
        Serial.write(txdata, 4);
        //Serial.println("Back");      
        //httpd_resp_set_type(req, "text/html");
        //return httpd_resp_send(req, "OK", 2);              
      }
    }        
    else 
    { 
      Serial.println("variable");
      res = -1; 
    }

